import ProfilePic from "../assets/profile-pic.jpg"

const AboutMe = () => {
    return(
        <div className="flex gap-8 flex-col md:flex-row">
            <img src={ProfilePic} className="w-80 h-80 object-cover object-top"/>
            <div>
                <h1 className="text-lg text-black text-center font-semibold mb-5">இளையராஜா சுப்ரமணியன்</h1>
                <p className="leading-7 mb-5">திருச்சி மாவட்டம் துறையூர் தாலுக்காவில் பிறந்து பள்ளிப் படிப்பை துறையூரிலும் கல்லூரிப் படிப்பை திருச்சியிலும் முடித்திருக்கிறேன். கணிப்பொறி வல்லுனராக 14 ஆண்டு அனுபவம் இருந்தாலும் புத்தகங்கள் வாசிப்பதிலும் பல மொழிகளில் வெளியான நல்ல உலகத் திரைப்படங்களைப் பார்ப்பத்திலும் பெரும் ஆர்வம் கொண்டவன். 2011 ஆம் ஆண்டு ஆர்வம் மிகுதியின் காரணமாக "இது என் பக்கம்" என்ற வலைதளத்தை உருவாக்கி தொடர்ச்சியாக 14 ஆண்டுகளுக்கும் மேலாக எழுதி வருகிறேன். வேலைப்பளுவின் காரணமாக பல நாட்கள் எழுத முடியாது போனாலும் நேரம் கிடைக்கும் போது கட்டாயம் பதிவுகள் எழுதிவிடுவேன்.</p>
                <p className="leading-7 mb-5">12 சிறுகதைகளும் 1 நாவலும் 1 கவிதைத் தொகுப்பும் எழுதியுள்ளேன். அவை அனைத்தும் மின் நூல்களாக அமேசான் தளத்திலும் இருக்கின்றன. வாய்ப்பும் நேரமும் ஆர்வமும் இருந்தால் வாசித்து உங்கள் கருத்துக்களைப் பகிர்ந்து கொள்ளுங்கள். </p>
                <p>
                    தொடர்ந்து உங்கள் ஆதரவை தரும்படி கேட்டுக் கொள்கிறேன். நன்றி!
                </p>
            </div>
        </div>
    )
}

export default AboutMe